In [2]:
import pandas as pd
import numpy as np

In [207]:
df = pd.read_csv("train.csv", sep=",", index_col ='PassengerId')

In [208]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [42]:
df['Age'].isnull().sum()

177

In [43]:
df['Cabin'].isnull().sum()

687

In [51]:
mean_age = df['Age'].mean()
mean_age
df['Age'].fillna(mean_age, inplace= True)

In [52]:
mean_fare = df['Fare'].mean()

In [53]:
df['Fare'].fillna(mean_fare, inplace= True)

In [54]:
df[df['Pclass'] == 3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.000000,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.000000,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.000000,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.000000,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.000000,0,5,382652,29.1250,NaN,Q
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,NaN,Q

In [36]:
df[df['Pclass'] == 2]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
13,905,2,"Howard, Mr. Benjamin",male,63.0,1,0,24065,26.0000,NaN,S
15,907,2,"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",female,24.0,1,0,SC/PARIS 2167,27.7208,NaN,C
16,908,2,"Keane, Mr. Daniel",male,35.0,0,0,233734,12.3500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...
387,1279,2,"Ashby, Mr. John",male,57.0,0,0,244346,13.0000,NaN,S
393,1285,2,"Gilbert, Mr. William",male,47.0,0,0,C.A. 30769,10.5000,NaN,S
401,1293,2,"Gale, Mr. Harry",male,38.0,1,0,28664,21.0000,NaN,S
405,1297,2,"Nourney, Mr. Alfred (Baron von Drachstedt"")""",male,20.0,0,0,SC/PARIS 2166,13.8625,D38,C
406,1298,2,"Ware, Mr. William Jeffery",male,23.0,1,0,28666,10.5000,NaN,S

In [55]:
df[df['Pclass'] == 1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [75]:
# df[(df['Pclass'] == 1) & (df['Survived'] == 1 )]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.000000,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.000000,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.000000,0,0,113788,35.5000,A6,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,29.699118,1,0,PC 17569,146.5208,B78,C
...,...,...,...,...,...,...,...,...,...,...,...,...
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.000000,0,0,17466,25.9292,D17,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.000000,1,1,11751,52.5542,D35,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.000000,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C

In [183]:
df.groupby('Pclass')['Survived'].value_counts()

Pclass  Survived
1       1           136
        0            80
2       0            97
        1            87
3       0           372
        1           119
Name: Survived, dtype: int64

In [186]:
# C1
survivedC1 = len(df[(df['Pclass'] == 1) & (df['Survived'] == 1)])
totalC1 = len(df[(df['Pclass'] == 1) ])
print(survivedC1/totalC1)

0.6296296296296297

In [188]:
# C2
survivedC2 = len(df[(df['Pclass'] == 2) & (df['Survived'] == 1)])
totalC2 = len(df[(df['Pclass'] == 2) ])
print(survivedC2/totalC2)

0.47282608695652173

In [189]:
# C3
survivedC3 = len(df[(df['Pclass'] == 3) & (df['Survived'] == 1)])
totalC3 = len(df[(df['Pclass'] == 3) ])
print(survivedC3/totalC3)

0.24236252545824846

In [124]:
# ((df["Survived"]==1) & (df['Sex'] == 'female')).sum()
# ((df["Survived"]==1) & (df['Sex'] == 'male')).sum()
# ((df["Survived"]==0) & (df['Sex'] == 'female')).sum()
# ((df["Survived"]==0) & (df['Sex'] == 'male')).sum()

df.groupby('Sex')['Survived'].value_counts()

Sex     Survived
female  1           233
        0            81
male    0           468
        1           109
Name: Survived, dtype: int64

In [179]:
WomenAndChild = df[(df["Survived"]==1) & (df['Sex'] == 'female') | ( df['Sex'] == 'male') & (df['Age'] < 18) & (df['Survived'] == 1)]
# df[(df["Survived"]==1) & (df['Sex'] == 'female')]
# WomenAndChild[WomenAndChild['Sex'] == 'male']
len(WomenAndChild)

256

In [181]:
#Total survived
totalSurvived = len(df[df['Survived'] == 1])
totalSurvived

342

In [182]:
#Men
print(totalSurvived - len(WomenAndChild))

86

In [172]:
len(df[(df['Pclass']==1) & (df['Survived'] == 1) & (df['Sex'] == 'male') & (df['Age'] >= 18)])
# df

41

In [173]:
len(df[(df['Pclass']==2) & (df['Survived'] == 1) & (df['Sex'] == 'male') & (df['Age'] >= 18)])
# df

8

In [174]:
len(df[(df['Pclass']==3) & (df['Survived'] == 1) & (df['Sex'] == 'male') & (df['Age'] >= 18)])
# df

37

In [192]:
df[df['Survived'] == 1]['Age'].mean()

28.54977812177503

In [193]:
df[df['Survived'] == 1]['Age'].max()

80.0

In [194]:
df[df['Survived'] == 1]['Age'].min()

0.42

In [195]:
df[df['Survived'] == 0]['Age'].mean()

30.415099646415896

In [196]:
df[df['Survived'] == 0]['Age'].max()

74.0

In [197]:
df[df['Survived'] == 0]['Age'].min()

1.0

In [198]:
len(df[df['Survived'] == 1])

342

In [201]:
len((df[(df['Survived'] == 1) & (df['SibSp'] == 1)]))

112

In [202]:
len((df[(df['Survived'] == 1) & (df['SibSp'] == 0)]))

210

In [204]:
112/342

0.32748538011695905

In [205]:
len((df [(df['SibSp'] == 1)]))

209